In [6]:
import glob
import pandas as pd
from datetime import datetime

In [7]:
def extract_from_json(file_to_process):
    dataframe = pd.read_json(file_to_process)
    return dataframe

In [9]:
# Preview the bank market cap 1 file

jsonfile1 = pd.read_json("bank_market_cap_1.json")
jsonfile1

                                       Name  Market Cap (US$ Billion)
0                            JPMorgan Chase                   390.934
1   Industrial and Commercial Bank of China                   345.214
2                           Bank of America                   325.331
3                               Wells Fargo                   308.013
4                   China Construction Bank                   257.399
..                                      ...                       ...
65                             Ping An Bank                    37.993
66                       Standard Chartered                    37.319
67                     United Overseas Bank                    35.128
68                                QNB Group                    33.560
69                              Bank Rakyat                    33.081

[70 rows x 2 columns]

In [10]:
# Get shape of jsonfile1
jsonfile1.shape

(70, 2)

In [11]:
# Preview the bank market cap 2 file

jsonfile2 = pd.read_json("bank_market_cap_2.json")
jsonfile2.head(3)

                               Name  Market Cap (US$ Billion)
35  Banco Bilbao Vizcaya Argentaria                    60.678
36                  Japan Post Bank                    60.525
37      The Bank of New York Mellon                    59.823

In [13]:
# Get shape of jsonfile1
jsonfile2.shape

(35, 2)

In [14]:
# Column names for the dataframe
columns = ["Name", "Market Cap (US$ Billion)"]

def extract():
    """Find json files, extract the files, and store data in pandas dataframe"""
    # Write your code here
    extracted_data = pd.DataFrame(columns = columns)

    for jsonfile in glob.glob("*.json"):
        extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)
    
    return extracted_data

In [15]:
# Preview extracted_data

preview_extracted_json = extract()
preview_extracted_json

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21368\4062058542.py:10: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)

                                        Name  Market Cap (US$ Billion)
0                             JPMorgan Chase                   390.934
1    Industrial and Commercial Bank of China                   345.214
2                            Bank of America                   325.331
3                                Wells Fargo                   308.013
4                    China Construction Bank                   257.399
..                                       ...                       ...
100                             Ping An Bank                    37.993
101                       Standard Chartered                    37.319
102                     United Overseas Bank                    35.128
103                                QNB Group                    33.560
104                              Bank Rakyat                    33.081

[105 rows x 2 columns]

In [16]:
# Test and preview csv file

url = "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-PY0221EN-SkillsNetwork/labs/module%206/Final%20Assignment/exchange_rates.csv"

dataframe = pd.read_csv('exchange_rates.csv', index_col = 0)
dataframe.head(10)

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [17]:
def read_csv(file_to_process):
    """Method to read csv file"""
    dataframe = pd.read_csv(file_to_process, index_col = 0)
    return dataframe

def extract_csv():
    """Method to extract csv file"""
    for csvfile in glob.glob("*.csv"):
        extracted_csv_data = pd.DataFrame(read_csv(csvfile))
        
    return extracted_csv_data

In [19]:
# Preview dataframe from csv file

preview_extracted_csv = extract_csv().head(10)
preview_extracted_csv

         Rates
AUD   1.297088
BGN   1.608653
BRL   5.409196
CAD   1.271426
CHF   0.886083
CNY   6.483139
CZK  21.510117
DKK   6.119757
EUR   0.822504
GBP   0.732398

In [20]:
# Get GBP rate and convert to float

exchange_rate = float(preview_extracted_csv.loc["GBP"])
exchange_rate

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21368\2801866754.py:3: FutureWarning: Calling float on a single element Series is deprecated and will raise a TypeError in the future. Use float(ser.iloc[0]) instead
  exchange_rate = float(preview_extracted_csv.loc["GBP"])

0.7323984208000001

In [21]:
def transform(data):
    """Convert Market Cap from USD to GBP"""
    
    # Convert USD to GBP and round to 3 decimal places
    data["Market Cap (US$ Billion)"] = round(data["Market Cap (US$ Billion)"] * exchange_rate, 3)
    # Other solution - creating a new column and drop the existing column
    # data["Market Cap (GBP$ Billion)"] = round(data["Market Cap (US$ Billion)"] * exchange_rate, 3)
    # data = data.drop("Market Cap (US$ Billion)", axis = 1, inplace = True)
    
    # Rename Columns
    data.rename(columns = {"Name": "Name", "Market Cap (US$ Billion)": "Market Cap (GBP$ Billion)"}, inplace = True, errors = "raised")
    
    return data

In [22]:
# Preview transformed data

preview_transform = transform(preview_extracted_json)
preview_transform.head(5)

                                      Name  Market Cap (GBP$ Billion)
0                           JPMorgan Chase                    286.319
1  Industrial and Commercial Bank of China                    252.834
2                          Bank of America                    238.272
3                              Wells Fargo                    225.588
4                  China Construction Bank                    188.519

In [24]:
# Assign a filename for csv
filename = "bank_market_cap_gbp.csv"

def load(filename, data):
    """Takes a dataframe and save it to csv file named, bank_market_cap_gbp.csv"""
    data.to_csv(filename, index = False)

In [25]:
# Assign a filename for log text
logfilename = "bmc_log.txt"

def log(message):
    """Method for logging function"""
    
    # Timestamp format
    timestamp = datetime.now().strftime("Date: %h %d, %Y - Time: %H:%M:%S")
    
    # Append log text
    with open(logfilename, "a") as txtfile:
        txtfile.write(f"{timestamp} --> {message}.\n")

In [26]:
# Running the ETL Process

# Log the process to text file
log("ETL Job Started")
log("Extract Phase Started")

In [27]:
# Call the function extract
extractedData = extract()

# Print the first five rows
extractedData.head(5)

C:\Users\Administrator\AppData\Local\Temp\ipykernel_21368\4062058542.py:10: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  extracted_data = extracted_data._append(extract_from_json(jsonfile), ignore_index = True)

                                      Name  Market Cap (US$ Billion)
0                           JPMorgan Chase                   390.934
1  Industrial and Commercial Bank of China                   345.214
2                          Bank of America                   325.331
3                              Wells Fargo                   308.013
4                  China Construction Bank                   257.399

In [28]:
# Log the process to text file
log("Extract Phase Ended")

In [29]:
# Log the process to text file
log("Transform Phase Started")

In [30]:
# Call the function transform
transformedData = transform(extractedData)

# Print the first five rows
transformedData.head(5)

                                      Name  Market Cap (GBP$ Billion)
0                           JPMorgan Chase                    286.319
1  Industrial and Commercial Bank of China                    252.834
2                          Bank of America                    238.272
3                              Wells Fargo                    225.588
4                  China Construction Bank                    188.519

In [31]:
# Log the process to text file
log("Transform Phase Ended")

In [32]:
# Log the process to text file
log("Load Phase Started")

In [33]:
# Call the load function
load(filename, transformedData)

In [34]:
log("Load Phase Ended")